Revit 2026 API

# PartUtilsGetSplittingElements Method

---

Identifies the elements ( reference planes, levels, grids ) that were used to create the part.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ISet<ElementId> GetSplittingElements(
	Document document,
	ElementId partId
)
```
```vb
Public Shared Function GetSplittingElements (
	document As Document,
	partId As ElementId
) As ISet(Of ElementId)
```
```cpp
public:
static ISet<ElementId^>^ GetSplittingElements(
	Document^ document,
	ElementId^ partId
)
```
```fsharp
static member GetSplittingElements :
        document : Document *
        partId : ElementId -> ISet<ElementId>
```

#### Parameters

document Document
     The source document of the part.
partId ElementId
     The part id.

#### Return Value

ISetElementId The elements that created the part. Empty if partId is not a Part or Part is not divided.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

PartUtils Class

Autodesk.Revit.DB Namespace